{
  "writing": {
    "task1": [
      {
        "id": "w1_task1",
        "type": "bar_chart",
        "title": "Internet Usage by Age Group",
        "description": "The chart below shows the percentage of internet users in different age groups in a particular country from 2010 to 2020. Summarize the information by selecting and reporting the main features, and make comparisons where relevant.",
        "data": {
          "chart_type": "bar_chart",
          "title": "Internet Usage by Age Group (%)",
          "x_axis": "Age Groups",
          "y_axis": "Percentage of Internet Users",
          "data": [
            {"age_group": "18-25", "2010": 85, "2015": 92, "2020": 98},
            {"age_group": "26-35", "2010": 78, "2015": 88, "2020": 95},
            {"age_group": "36-45", "2010": 65, "2015": 78, "2020": 88},
            {"age_group": "46-55", "2010": 45, "2015": 62, "2020": 75},
            {"age_group": "56-65", "2010": 25, "2015": 42, "2020": 58},
            {"age_group": "65+", "2010": 12, "2015": 28, "2020": 45}
          ]
        },
        "sample_answer": "The bar chart illustrates the percentage of internet users across different age groups in a particular country over a ten-year period from 2010 to 2020.\n\nOverall, internet usage increased significantly across all age groups during this period, with younger demographics showing consistently higher adoption rates.\n\nThe 18-25 age group had the highest internet usage throughout the period, rising from 85% in 2010 to 98% in 2020. Similarly, the 26-35 age group showed strong growth, increasing from 78% to 95% over the same period.\n\nMiddle-aged groups (36-45 and 46-55) demonstrated substantial growth, with the 36-45 group rising from 65% to 88%, and the 46-55 group more than doubling from 45% to 75%.\n\nThe most dramatic increase occurred in older age groups. The 56-65 age group saw usage more than double from 25% to 58%, while the 65+ group experienced the largest proportional growth, increasing nearly fourfold from 12% to 45%.\n\nIn conclusion, while younger demographics maintained higher internet usage rates, older age groups showed the most significant growth, indicating successful digital inclusion across all generations."
      },
      {
        "id": "w2_task1",
        "type": "line_graph",
        "title": "Global Temperature Anomalies",
        "description": "The graph below shows global temperature anomalies from 1880 to 2020. Summarize the information by selecting and reporting the main features, and make comparisons where relevant.",
        "data": {
          "chart_type": "line_graph",
          "title": "Global Temperature Anomalies (°C)",
          "x_axis": "Year",
          "y_axis": "Temperature Anomaly (°C)",
          "data": [
            {"year": 1880, "anomaly": -0.2},
            {"year": 1900, "anomaly": -0.3},
            {"year": 1920, "anomaly": -0.1},
            {"year": 1940, "anomaly": 0.1},
            {"year": 1960, "anomaly": 0.0},
            {"year": 1980, "anomaly": 0.2},
            {"year": 2000, "anomaly": 0.6},
            {"year": 2020, "anomaly": 1.0}
          ]
        },
        "sample_answer": "The line graph displays global temperature anomalies from 1880 to 2020, showing deviations from the long-term average temperature.\n\nOverall, the graph reveals a clear upward trend in global temperatures over the 140-year period, with the most significant warming occurring in recent decades.\n\nFrom 1880 to approximately 1940, temperatures remained below the long-term average, with anomalies ranging from -0.3°C to 0.1°C. The lowest point occurred around 1900 at -0.3°C.\n\nA gradual warming trend began around 1940, with temperatures reaching the long-term average by 1960. From this point onwards, the upward trend accelerated significantly.\n\nThe most dramatic warming occurred in the final two decades of the period. By 2000, the temperature anomaly had reached 0.6°C, and by 2020, it had increased to 1.0°C, representing the highest temperature anomaly in the entire dataset.\n\nIn conclusion, the data clearly demonstrates accelerating global warming, with the rate of temperature increase becoming more pronounced in recent decades."
      }
    ],
    "task2": [
      {
        "id": "w1_task2",
        "type": "discussion",
        "title": "Technology and Education",
        "question": "Some people believe that technology has made education more accessible, while others think it has created new barriers to learning. Discuss both views and give your own opinion.",
        "band_requirements": {
          "task_achievement": "Address both views and provide clear opinion",
          "coherence_cohesion": "Clear paragraph structure with linking words",
          "lexical_resource": "Academic vocabulary and collocations",
          "grammatical_range": "Complex sentences and varied structures"
        },
        "sample_answer": "The integration of technology in education has sparked considerable debate about its impact on learning accessibility. While some argue that technology has democratized education, others contend that it has created new digital divides.\n\nProponents of technology in education highlight several advantages. Online learning platforms have made education accessible to people in remote areas who previously lacked access to quality institutions. Massive Open Online Courses (MOOCs) have enabled millions of learners worldwide to access courses from prestigious universities at minimal cost. Additionally, assistive technologies have opened doors for students with disabilities, providing tools like screen readers and voice recognition software that facilitate learning.\n\nHowever, critics argue that technology has created new barriers to education. The digital divide means that students without reliable internet access or modern devices are at a significant disadvantage. This inequality is particularly pronounced in developing countries and rural areas where infrastructure is inadequate. Furthermore, the shift to online learning during the COVID-19 pandemic highlighted how technology can exclude students who lack the necessary resources or digital literacy skills.\n\nIn my opinion, while technology has undoubtedly expanded educational opportunities, its benefits are not equally distributed. The key challenge is ensuring equitable access to educational technology. Governments and institutions must invest in infrastructure and provide support to bridge the digital divide. Only then can technology truly fulfill its potential to make education universally accessible.\n\nIn conclusion, technology's impact on education accessibility is complex. While it has created new opportunities for many, it has also highlighted and potentially exacerbated existing inequalities. The solution lies not in abandoning technology but in ensuring that its benefits reach all learners, regardless of their socioeconomic circumstances."
      },
      {
        "id": "w2_task2",
        "type": "problem_solution",
        "title": "Urbanization and Environmental Challenges",
        "question": "Many cities around the world are facing serious environmental problems. What are the main causes of these problems and what solutions can be implemented?",
        "band_requirements": {
          "task_achievement": "Identify main causes and propose specific solutions",
          "coherence_cohesion": "Logical flow from problems to solutions",
          "lexical_resource": "Environmental vocabulary and technical terms",
          "grammatical_range": "Conditional sentences and passive voice"
        },
        "sample_answer": "Urban environmental degradation has become a critical global issue, with cities worldwide struggling to balance rapid growth with environmental sustainability. The primary causes stem from population density, industrial activities, and inadequate planning, but several effective solutions can address these challenges.\n\nThe main causes of urban environmental problems are multifaceted. Rapid urbanization has led to overcrowding, resulting in increased waste generation and air pollution from vehicles and industrial emissions. Many cities lack adequate green spaces and suffer from the urban heat island effect, where concrete and asphalt absorb and retain heat. Additionally, poor waste management systems and insufficient recycling infrastructure contribute to land and water pollution. The concentration of economic activities in urban centers also leads to excessive resource consumption and energy demand.\n\nSeveral solutions can effectively address these environmental challenges. First, implementing comprehensive public transportation systems can reduce vehicle emissions and traffic congestion. Cities like Copenhagen and Amsterdam have successfully integrated cycling infrastructure, significantly reducing air pollution. Second, developing green infrastructure, including urban forests, green roofs, and vertical gardens, can mitigate the heat island effect and improve air quality. Singapore's 'City in a Garden' initiative demonstrates how urban planning can incorporate nature effectively.\n\nFurthermore, adopting smart city technologies can optimize resource use and reduce environmental impact. Barcelona's smart city initiatives have reduced water consumption by 25% and energy use by 30% through intelligent monitoring systems. Finally, implementing strict environmental regulations and promoting sustainable building practices can ensure that new developments contribute positively to the urban environment.\n\nIn conclusion, while urban environmental problems are complex and interconnected, they are not insurmountable. Through strategic planning, technological innovation, and policy implementation, cities can transform into sustainable, livable environments that benefit both residents and the planet."
      },
      {
        "id": "w3_task2",
        "type": "opinion",
        "title": "Remote Work and Social Interaction",
        "question": "Some people think that remote work has negative effects on social interaction and teamwork. To what extent do you agree or disagree?",
        "band_requirements": {
          "task_achievement": "Clear position with supporting arguments",
          "coherence_cohesion": "Strong thesis and logical development",
          "lexical_resource": "Workplace and social vocabulary",
          "grammatical_range": "Complex sentences and varied tenses"
        },
        "sample_answer": "The rise of remote work has fundamentally altered how people interact in professional settings, leading to concerns about its impact on social connections and collaborative efforts. While I acknowledge that remote work presents challenges to traditional social interaction, I believe that with proper adaptation, it can actually enhance teamwork and create new forms of meaningful social connection.\n\nCritics of remote work argue that it eliminates the spontaneous interactions that occur in physical offices, such as water cooler conversations and impromptu meetings that often lead to innovative ideas. They contend that virtual communication lacks the nuance of face-to-face interaction, including body language and tone, which can lead to misunderstandings and reduced empathy among team members. Additionally, the absence of shared physical spaces may weaken team cohesion and company culture.\n\nHowever, I believe these concerns can be addressed through intentional design of remote work practices. Modern technology has evolved to support rich virtual interactions through video conferencing, collaborative platforms, and virtual reality meeting spaces. Companies that invest in these tools and establish regular virtual social events can maintain and even strengthen team bonds. For instance, many organizations have implemented virtual coffee breaks, online team-building activities, and digital collaboration spaces that foster creativity and connection.\n\nMoreover, remote work can actually improve social interaction by removing geographical barriers and enabling more diverse teams. People who might not have been able to participate in traditional office environments due to disabilities, caregiving responsibilities, or geographical constraints can now contribute fully to team projects. This inclusivity can lead to richer, more diverse perspectives and stronger team outcomes.\n\nIn conclusion, while remote work does change the nature of social interaction in professional settings, I disagree that these changes are inherently negative. With thoughtful implementation of technology and intentional efforts to maintain social connections, remote work can actually enhance teamwork and create more inclusive, flexible work environments that benefit both individuals and organizations."
      }
    ]
  }
}
